#Задача 2: Найдите сумму цифр трехзначного числа.
print('введите 3х значное число')
number = str(input())
a = int(number[0])
b = int(number[1])
c = int(number[2])
print (a+b+c)